[
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Is Nikki Haley auditioning to replace Pence on Trump's 2020 ticket?",
    "DateInt": "20191112",
    "Date": "Tue, 12 Nov 2019 11:34:28 -0500",
    "Link": "https://news.yahoo.com/nikki-haley-book-tour-audition-vp-pence-trump-2020-ticket-163428688.html",
    "Summary": "[image 1: Is Nikki Haley auditioning to replace Pence on Trump's 2020 ticket?][1] Less than three months ago, the former U.S. ambassador to the United Nations tried to tamp down speculation that she might replace the vice president on Trump’s 2020 ticket. But multiple political observers say her new book tour is doubling as an audition for the role.",
    "Links": [
      "https://news.yahoo.com/nikki-haley-book-tour-audition-vp-pence-trump-2020-ticket-163428688.html",
      "http://l2.yimg.com/uu/api/res/1.2/XnMA9mstMRV0FkOdMugjhg--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-11/f1884750-fcd3-11e9-bcf7-cef09bc7ad91"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Immigration officer blows whistle on 'morally objectionable' Trump asylum policy",
    "DateInt": "20191113",
    "Date": "Wed, 13 Nov 2019 12:09:02 -0500",
    "Link": "https://news.yahoo.com/immigration-officer-blows-whistle-on-morally-objectionable-trump-asylum-policy-170902774.html",
    "Summary": "[image 1: Immigration officer blows whistle on 'morally objectionable' Trump asylum policy][1] A new anonymous whistleblower has accused the Trump administration of requiring U.S. asylum officers to enforce an illegal and immoral policy “clearly designed to further this administration's racist agenda of keeping Hispanic and Latino populations from entering the United States.”",
    "Links": [
      "https://news.yahoo.com/immigration-officer-blows-whistle-on-morally-objectionable-trump-asylum-policy-170902774.html",
      "http://l.yimg.com/uu/api/res/1.2/yNVwYmqKaLb3EZLc7wAnTw--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-11/173727c0-0637-11ea-afa6-2c8c926c8f7d"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Venezuela ex-intel chief missing in Spain ahead of US extradition: police",
    "DateInt": "20191113",
    "Date": "Wed, 13 Nov 2019 04:46:30 -0500",
    "Link": "https://news.yahoo.com/venezuela-ex-intel-chief-missing-spain-ahead-us-094630755.html",
    "Summary": "[image 1: Venezuela ex-intel chief missing in Spain ahead of US extradition: police][1] Venezuela's former military intelligence chief has gone missing in Spain just days after a court approved a request for his extradition to the United States on drug trafficking charges, police said Wednesday.  \"They are currently looking for him,\" said a spokeswoman for Spain's national police, referring to General Hugo Armando Carvajal.  Judicial sources said police had gone to his house in Madrid after Friday's court decision but could not find him.",
    "Links": [
      "https://news.yahoo.com/venezuela-ex-intel-chief-missing-spain-ahead-us-094630755.html",
      "http://l.yimg.com/uu/api/res/1.2/BT2DVUbtArV0PJan_OXwew--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/http://media.zenfs.com/en_us/News/afp.com/35366d9258f1ed35efa49132bcbf8ee720e99d86.jpg"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Taiwan Wants American F-16V Fighters but Will Washington Sell Them?",
    "DateInt": "20191112",
    "Date": "Tue, 12 Nov 2019 01:00:00 -0500",
    "Link": "https://news.yahoo.com/taiwan-wants-american-f-16v-060000270.html",
    "Summary": "[image 1: Taiwan Wants American F-16V Fighters but Will Washington Sell Them?][1] Taipei is worried about China.",
    "Links": [
      "https://news.yahoo.com/taiwan-wants-american-f-16v-060000270.html",
      "http://l2.yimg.com/uu/api/res/1.2/54XFI25c21FbfZbeQcMWCw--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media.zenfs.com/en/the_national_interest_705/e15027f4df6c6a39ff30c6f022bd5452"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "U.S. Supreme Court declines to shield gun maker from Sandy Hook lawsuit",
    "DateInt": "20191112",
    "Date": "Tue, 12 Nov 2019 10:11:05 -0500",
    "Link": "https://news.yahoo.com/u-supreme-court-not-shield-144156981.html",
    "Summary": "[image 1: U.S. Supreme Court declines to shield gun maker from Sandy Hook lawsuit][1] The U.S. Supreme Court on Tuesday dealt a blow to the firearms industry, rejecting Remington Arms Co's bid to escape a lawsuit by families of victims aiming to hold the gun maker liable for its marketing of the assault-style rifle used in the 2012 Sandy Hook school massacre that killed 20 children and six adults. The justices turned away Remington's appeal of a ruling by Connecticut's top court to let the lawsuit proceed despite a federal law that broadly shields firearms manufacturers from liability when their weapons are used in crimes. The lawsuit will move forward at a time of high passions in the United States over the issue of gun control.",
    "Links": [
      "https://news.yahoo.com/u-supreme-court-not-shield-144156981.html",
      "http://l2.yimg.com/uu/api/res/1.2/psMdhRx0IUospp4sr3ol2Q--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media.zenfs.com/en-US/reuters.com/3821228938d34cfcc9adb8f477a4bf2e"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Hillary Clinton: I Want to Hug Meghan Markle After ‘Racist’ Abuse in Britain",
    "DateInt": "20191112",
    "Date": "Tue, 12 Nov 2019 08:26:11 -0500",
    "Link": "https://news.yahoo.com/hillary-clinton-want-hug-meghan-132611111.html",
    "Summary": "[image 1: Hillary Clinton: I Want to Hug Meghan Markle After ‘Racist’ Abuse in Britain][1] SAMUEL CORUMHillary Clinton has said she wishes she could hug Meghan Markle as she accused the mainstream British media of participating in a cycle of abuse against her motivated by racism and sexism.The former first lady and presidential candidate was appearing on BBC radio in Britain to promote a new book she has written with her daughter, Chelsea, about “gutsy” women.Don’t Expect Prince Harry and Meghan Markle’s Media War to Simmer Down SoonHillary said the abuse she had suffered was “heartbreaking and wrong” and said she was in no doubt there was a racial element to the abuse she has endured since starting a relationship with Harry in 2016 and marrying him in 2018.Meghan and Harry have been outspoken in their criticism of the press: Meghan is suing the Mail on Sunday after alleging the paper unlawfully published a private letter to her father, while the prince is bringing a separate case alleging phone-hacking.Asked to comment on her legal action, Chelsea Clinton said: “We each have to do what we think is the right thing for ourselves and in her case I would imagine for her son… I think absolutely there’s a racist and a sexist element to what’s going on here.” Hillary added that “race was clearly an element” in some of the social-media backlash Meghan had faced since her relationship with the prince began in 2016, and that traditional media had amplified that.  “To think that some of your, what we would call mainstream media, actually allowed that to be printed in their pages, or amplified, was heartbreaking and wrong. “She is an amazing young woman, she has an incredible life story. She has stood up for herself, she has made her own way in the world. And then she falls in love, and he falls in love with her, and everybody should be celebrating that because it is a true love story.“I feel as a mother I just want to put my arms around her. Oh my God, I want to hug her. I want to tell her to hang in there, don’t let those bad guys get you down.”Clinton suggested that Meghan could employ “some humor, some deflection” to better cope with negative attention.Read more at The Daily Beast.Get our top stories in your inbox every day. Sign up now!Daily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.",
    "Links": [
      "https://news.yahoo.com/hillary-clinton-want-hug-meghan-132611111.html",
      "http://l2.yimg.com/uu/api/res/1.2/vINz_TPNz3QUFRXV24emNg--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media.zenfs.com/en-US/thedailybeast.com/51e1d1850b91f8690cfc10f37bebe715"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Don't miss Sunday's shooting stars: The Leonid meteor shower will be visible across the night sky",
    "DateInt": "20191112",
    "Date": "Tue, 12 Nov 2019 14:51:03 -0500",
    "Link": "https://news.yahoo.com/dont-miss-sundays-shooting-stars-174318886.html",
    "Summary": "[image 1: Don't miss Sunday's shooting stars: The Leonid meteor shower will be visible across the night sky][1] Look up Sunday night, and you may see the Leonid meteor showers, which come from the constellation Leo the Lion.",
    "Links": [
      "https://news.yahoo.com/dont-miss-sundays-shooting-stars-174318886.html",
      "http://l.yimg.com/uu/api/res/1.2/5INhD5Ko1qBYBvmZfxn9Kg--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media.zenfs.com/en-us/usa_today_news_641/cf4e395d1e3e467810dbec8f130ef176"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Woman who spoke at Epstein's bail hearing sues his estate",
    "DateInt": "20191112",
    "Date": "Tue, 12 Nov 2019 17:13:33 -0500",
    "Link": "https://news.yahoo.com/woman-spoke-epsteins-bail-hearing-202432382.html",
    "Summary": "[image 1: Woman who spoke at Epstein's bail hearing sues his estate][1] A woman who confronted Jeffrey Epstein at a July bail hearing to tell a judge he touched her inappropriately when she was 16 sued his estate Tuesday, alleging he had subjected her to sex trafficking as part of his attacks on young women and girls.  Lawyers for Annie Farmer filed the lawsuit in Manhattan federal court, along with a lawsuit on behalf of her sister, Maria Farmer, and Teresa Helm, an Ohio woman.  A lawyer for Epstein's estate did not return a message seeking comment.",
    "Links": [
      "https://news.yahoo.com/woman-spoke-epsteins-bail-hearing-202432382.html",
      "http://l2.yimg.com/uu/api/res/1.2/QhXHDrazvcPbnO2Kwb4bNw--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media.zenfs.com/en/ap.org/9a74f77a5c1aa04bd8a2336b68d96fed"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Condoleezza Rice Calls Giuliani’s Ukraine Involvement ‘Deeply Troubling’",
    "DateInt": "20191111",
    "Date": "Mon, 11 Nov 2019 16:23:50 -0500",
    "Link": "https://news.yahoo.com/condoleezza-rice-calls-giuliani-ukraine-212350225.html",
    "Summary": "[image 1: Condoleezza Rice Calls Giuliani’s Ukraine Involvement ‘Deeply Troubling’][1] Former secretary of state Condoleezza Rice said Monday that reports detailing the involvement of President Trump’s personal lawyer Rudy Giuliani in the White House’s Ukraine policy were “deeply troubling.”“What I see right now troubles me. I see a state of conflict between the foreign policy professionals and someone who says he’s acting on behalf of the president but frankly I don’t know if that is the case,” Rice said at a conference in Abu Dhabi. “This is just not a good thing. The world shouldn’t get confusing messages from the United States of America.”Multiple witnesses have alleged in house testimony that Giuliani conducted his own investigative work without regard for the administration’s formal policy.William Taylor, the former top American diplomat in Ukraine, whose testimony was released last week, asserted that Giuliani was actively undermining U.S. foreign policy.“The irregular channel seemed to focus on specific issues, specific cases, rather than the regular channel’s focus on institution building,” Taylor said, according to the transcript. “So the irregular channel, I think under the influence of Mr. Giuliani, wanted to focus on one or two specific cases, irrespective of whether it helped solve the corruption problem, fight the corruption problem.”Earlier Monday, news broke that Lev Parnas, an associate of Giuliani, will tell investigators that Giuliani attempted to leverage an official visit from Vice President Mike Pence to coax Ukraine into announcing an investigation into Joe Biden's son Hunter's business connections to Burisma.Rice also said she thought Trump’s mention of former vice president Joe Biden and his son Hunter, who served on the board of Ukrainian gas company Burisma, during the call was “out of bounds.”“The call is murky, it is really murky. I don’t like for the president of the United States to mention an American citizen for investigation to a foreign leader,” Rice said.",
    "Links": [
      "https://news.yahoo.com/condoleezza-rice-calls-giuliani-ukraine-212350225.html",
      "http://l.yimg.com/uu/api/res/1.2/5TPWGwUq3s2GkDN0aOnSZA--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://media.zenfs.com/en-US/the_national_review_738/e77c1df82642b1d298bd0c032af54702"
    ]
  },
  {
    "Feed": "Yahoo News - Latest News & Headlines",
    "Title": "Could President Trump be impeached and removed from office — but still reelected?",
    "DateInt": "20191112",
    "Date": "Tue, 12 Nov 2019 13:46:43 -0500",
    "Link": "https://news.yahoo.com/could-president-trump-be-impeached-and-removed-from-office-but-still-reelected-184643831.html",
    "Summary": "[image 1: Could President Trump be impeached and removed from office — but still reelected?][1] What happens when a presidential impeachment inquiry runs into a presidential election year? The United States in uncharted territory.",
    "Links": [
      "https://news.yahoo.com/could-president-trump-be-impeached-and-removed-from-office-but-still-reelected-184643831.html",
      "http://l2.yimg.com/uu/api/res/1.2/7LKu1VqFsBWR.ZGGf.U.zQ--/YXBwaWQ9eXRhY2h5b247aD04Njt3PTEzMDs-/https://s.yimg.com/os/creatr-images/2019-11/fae1bf00-0581-11ea-93ff-f43ed8c16284"
    ]
  }
]